/*package DynamicArrayMethod;

/*public class DynamicArrayMethod {
սա մասսիվն է,որը միայն ներքին օգտագործման համար է,և որը հետո extend մեթոդի մեջ մեծանալու է
private int[] array=new int[16];

private int size=0
սա մասսինի մեջի էլեմենտների քանակն է,սկզբից 0 է,հետո ամեն անգամ երբ կանչենք ադդ մեթոդը պիտի size-ը մեծանա 1-ով


public void add(int value){}
այս մեթոդը նախատեսված է մասիվի մեջ ավելացնել ընդունող value-ն,ամեն անգամ ավելացնելուց առաջ պետք է ստուգել
 արդյոք մասսիվի մեջ տեղ կա թե ոչ,եթե չկա կանչել extend մեթոդը



 private void extend(){}
 այս մեթոդի նպատակն է ստեղծել նոր մասիվ որը կլինի array-ի նախկին չափո+10 էլէմենտանի,հետո ցիկլով կազմակերպել
 հին մասիվի էլեմենտների վերագրումը նոր մասիվին,և վերջում հին մասիվին վերագրել նոր մասիվ;



 public int get(int i){
 return 0;}
 այս մեթոդը վերադարձնում է մասիվի i-րդ էլեմենտը



 public void print(){}
 այս մեթոդը տպում է array-ի Էլեմենտները









}*/
